app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 18 Feb 2014 13:57:41 UTC +00:00], ["updated_at", Tue, 18 Feb 2014 13:57:41 UTC +00:00]]
INSERT INTO "addresses" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 19 Feb 2014 08:20:48 UTC +00:00], ["updated_at", Wed, 19 Feb 2014 08:20:48 UTC +00:00]]
---
	def create
		@items = Item.new(item_params)
		@items.save
		@address = Address.new(address_params)
		@address.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", "14"]]
---
	def show
	     @items  = Item.find(params[:id])
	     @address = Address.find(params[:id])